noverapj/Legacy/src/NoveraClient/ioCannonWeaponItem.cpp
#include "StdAfx.h"
#include "ioCannonWeaponItem.h"
#include "ioCannonWeaponDummy.h"

#include "ioFloatThrowWeapon.h"
#include "ioZoneEffectWeapon.h"

ioCannonWeaponItem::ioCannonWeaponItem(void)
{
	m_iCurCombo = 0;
	m_fCurExtraGauge =0.0f;
	m_dwControlDummyIndex = -1;
	m_dwStayDummyIndex = -1;
	ClearData();
}

ioCannonWeaponItem::ioCannonWeaponItem( const ioCannonWeaponItem &rhs ):
ioWeaponItem( rhs ),
m_AttackReadyAniList( rhs.m_AttackReadyAniList ),
m_szDisableChargeBuff( rhs.m_szDisableChargeBuff ),
m_szControlDummyName( rhs.m_szControlDummyName ),
m_szStayDummyName( rhs.m_szStayDummyName ),
m_vControlDummyOffset( rhs.m_vControlDummyOffset ),
m_vStayDummyOffset( rhs.m_vStayDummyOffset ),
m_fCircleMinRange( rhs.m_fCircleMinRange ),
m_fCircleMaxRange( rhs.m_fCircleMaxRange ),
m_fCircleMoveSpeed( rhs.m_fCircleMoveSpeed ),
m_fCircleHeightGap( rhs.m_fCircleHeightGap ),
m_ReadyCircle( rhs.m_ReadyCircle ),
m_RedEffect( rhs.m_RedEffect ),
m_BlueEffect( rhs.m_BlueEffect ),
m_szCannonEndAni( rhs.m_szCannonEndAni ),
m_fCannonEndAniRate( rhs.m_fCannonEndAniRate ),
m_fWeaponFloatPower( rhs.m_fWeaponFloatPower ),
m_fWeaponFloatMinPower( rhs.m_fWeaponFloatMinPower ),
m_fWeaponMinSpeed( rhs.m_fWeaponMinSpeed ),
m_fWeaponGravityRate( rhs.m_fWeaponGravityRate ),
m_fRevisionRate( rhs.m_fRevisionRate ),
m_fUpLimitHeight( rhs.m_fUpLimitHeight ),
m_fUpLimitRange( rhs.m_fUpLimitRange ),
m_CannonAttack( rhs.m_CannonAttack ),
m_CannonFullAttack( rhs.m_CannonFullAttack ),
m_fCannonEscapeEndJumpPower( rhs.m_fCannonEscapeEndJumpPower ),
m_vOwnerBuffList( rhs.m_vOwnerBuffList ),
m_fCannonAttackNeedGauge( rhs.m_fCannonAttackNeedGauge ),
m_szCannonAttackAni( rhs.m_szCannonAttackAni ),
m_fCannonAttackAniRate( rhs.m_fCannonAttackAniRate )
{
	m_iCurCombo = 0;
	m_fCurExtraGauge =0.0f;
	m_dwControlDummyIndex = -1;
	m_dwStayDummyIndex = -1;
	ClearData();
}

ioCannonWeaponItem::~ioCannonWeaponItem(void)
{
}

ioItem* ioCannonWeaponItem::Clone()
{
	return new ioCannonWeaponItem( *this );
}

ioWeaponItem::WeaponSubType ioCannonWeaponItem::GetSubType() const
{
	return ioWeaponItem::WST_CANNON_ITEM;
}

void ioCannonWeaponItem::LoadProperty( ioINILoader &rkLoader )
{
	ioWeaponItem::LoadProperty( rkLoader );

	char szBuf[MAX_PATH] = "";
	char szKey[MAX_PATH] = "";

	//Attack Ready
	int iMaxCombo = GetMaxCombo();
	m_AttackReadyAniList.clear();
	if ( iMaxCombo > 0 )
	{
		m_AttackReadyAniList.reserve( iMaxCombo );
		for( int i=0; i < iMaxCombo; ++i )
		{
			wsprintf_e( szBuf, "attack_ready_animation%d", i+1 );
			rkLoader.LoadString( szBuf, "", szBuf, MAX_PATH );
			m_AttackReadyAniList.push_back( ioHashString(szBuf) );
		}
	}

	//Charge
	rkLoader.LoadString_e( "disable_charge_buff", "", szBuf, MAX_PATH );
	m_szDisableChargeBuff = szBuf;
	LoadWeaponInfo( "cannon_attack", m_CannonAttack, rkLoader );
	LoadWeaponInfo( "cannon_full_attack", m_CannonFullAttack, rkLoader );
	m_fCannonEscapeEndJumpPower = rkLoader.LoadFloat_e( "cannon_escape_end_jump_power", 0.0f );

	//Dummy
	rkLoader.LoadString_e( "control_dummy_name", "", szBuf, MAX_PATH );
	m_szControlDummyName = szBuf;
	rkLoader.LoadString_e( "stay_dummy_name", "", szBuf, MAX_PATH );
	m_szStayDummyName = szBuf;
	m_vControlDummyOffset.x = rkLoader.LoadFloat_e( "control_dummy_offset_x", 0.0f );
	m_vControlDummyOffset.y = rkLoader.LoadFloat_e( "control_dummy_offset_y", 0.0f );
	m_vControlDummyOffset.z = rkLoader.LoadFloat_e( "control_dummy_offset_z", 0.0f );
	m_vStayDummyOffset.x = rkLoader.LoadFloat_e( "stay_dummy_offset_x", 0.0f );
	m_vStayDummyOffset.y = rkLoader.LoadFloat_e( "stay_dummy_offset_y", 0.0f );
	m_vStayDummyOffset.z = rkLoader.LoadFloat_e( "stay_dummy_offset_z", 0.0f );

	//Magic Circle
	m_fCircleMinRange = rkLoader.LoadFloat_e( "magic_circle_min_range", 0.0f );
	m_fCircleMaxRange = rkLoader.LoadFloat_e( "magic_circle_max_range", 0.0f );
	m_fCircleMoveSpeed = rkLoader.LoadFloat_e( "magic_circle_move_speed", 0.0f );
	m_fCircleHeightGap = rkLoader.LoadFloat_e( "magic_circle_height_gap", 0.0f );
	rkLoader.LoadString_e( "ready_circle", "", szBuf, MAX_PATH );
	m_ReadyCircle = szBuf;
	rkLoader.LoadString_e( "red_team_effect", "", szBuf, MAX_PATH );
	m_RedEffect = szBuf;
	rkLoader.LoadString_e( "blue_team_effect", "", szBuf, MAX_PATH );
	m_BlueEffect = szBuf;

	rkLoader.LoadString_e( "cannon_end_ani", "", szBuf, MAX_PATH );
	m_szCannonEndAni = szBuf;
	m_fCannonEndAniRate = rkLoader.LoadFloat_e( "cannon_end_ani_rate", 0.0f );

	m_fWeaponGravityRate = rkLoader.LoadFloat_e( "weapon_gravity_rate", FLOAT1 );
	m_fWeaponFloatPower = rkLoader.LoadFloat_e( "gathering_float_power", 0.0f );
	m_fWeaponFloatMinPower = rkLoader.LoadFloat_e( "gathering_float_min_power", 0.0f );
	m_fWeaponMinSpeed = rkLoader.LoadFloat_e( "gathering_min_speed", 0.0f );

	m_fRevisionRate = rkLoader.LoadFloat_e( "gathering_revision_rate", 0.0f );

	//
	m_fUpLimitHeight = rkLoader.LoadFloat_e( "up_limit_height", 30.0f );
	m_fUpLimitRange = rkLoader.LoadFloat_e( "up_limit_range", 0.0f );

	int nBuffCnt = rkLoader.LoadInt_e( "owner_buff_cnt", 0 );
	m_vOwnerBuffList.clear();
	for ( int i=0; i<nBuffCnt; i++ )
	{
		wsprintf_e( szKey, "owner_buff%d", i+1 );
		rkLoader.LoadString( szKey, "", szBuf, MAX_PATH );
		m_vOwnerBuffList.push_back( szBuf );
	}

	m_fCannonAttackNeedGauge = rkLoader.LoadFloat_e( "cannon_attack_need_gauge", 0.0f );

	rkLoader.LoadString_e( "cannon_attack_ani", "", szBuf, MAX_PATH );
	m_szCannonAttackAni = szBuf;
	m_fCannonAttackAniRate = rkLoader.LoadFloat_e( "cannon_attack_ani_rate", 0.0f );
}

void ioCannonWeaponItem::ClearData()
{
	m_ChargeState = CS_NONE;
	m_SpecailState = SS_NONE;
	m_dwMotionStartTime = 0;
	m_dwMotionEndTime = 0;
	m_vCirclePos = ioMath::VEC3_ZERO;
	m_dwCurMapEffect = -1;
	m_vWeaponDir = ioMath::VEC3_ZERO;
	m_fCurWeaponMoveSpeed = 0.0f;
	m_fCurWeaponFloatPower = 0.0f;
	m_bCreateDummy = false;
	m_bFullGauge = false;
	m_dwCircleEffectID = -1;
	m_bCreateFullChargeEffect = false;
	m_CurDirKey = ioUserKeyInput::DKI_NONE;
}

void ioCannonWeaponItem::ClearSpecialState( ioBaseChar *pOwner )
{
	if ( !pOwner )
		return;

