noverapj/Legacy/src/NoveraClient/ioCannonWeaponItem.cpp
	m_SpecailState = SS_NONE;
	pOwner->SetAlphaRateDirect( MAX_ALPHA_RATE );
	pOwner->SetAttachEffectAlphaRateDirect( MAX_ALPHA_RATE, true );
	pOwner->SetHideChar( false );
	m_fCurExtraGauge = 0.0f;
	RemoveOwnerBuff( pOwner );
	RemoveCircleMapEffect( pOwner );
	ClearData();
}

int ioCannonWeaponItem::GetMaxBullet()
{
	return (int)m_fMaxExtraGauge;
}

int ioCannonWeaponItem::GetCurBullet()
{
	return m_fCurExtraGauge;
}

void ioCannonWeaponItem::SetCurBullet( int nCurBullet )
{
	if( nCurBullet < 0 )
		return;

	float fCurBullet = nCurBullet;
	fCurBullet = max( 0, min( fCurBullet, m_fMaxExtraGauge ) );

	m_fCurExtraGauge = fCurBullet;
}

int ioCannonWeaponItem::GetNeedBullet()
{
	return (int)m_fCannonAttackNeedGauge;
}

void ioCannonWeaponItem::DecreaseAllGauge()
{
	m_fCurExtraGauge = 0.0f;
}

void ioCannonWeaponItem::SetNormalAttack( ioBaseChar *pOwner, int iCurCombo )
{
	if( !pOwner )
		return;

	m_fCurChargeRate = 0.0f;
	m_fCurChargeRateForSkill = 0.0f;

	ClearCancelInfo();
	ClearData();

	int iComboCnt = GetMaxCombo();
	if( !COMPARE( iCurCombo, 0, iComboCnt ) )
	{
		ioWeaponItem::SetNormalAttack( pOwner, iCurCombo );

		m_ChargeState = CS_NONE;
		m_iCurCombo = iCurCombo;

		pOwner->SetAttackMoveEnable( false );
		pOwner->SetChargingState( false );
	}
	else
	{
		ioEntityGroup *pGrp = pOwner->GetGroup();
		pGrp->ClearAllLoopAni( FLOAT100, true );
		pGrp->ClearAllActionAni( FLOAT100, true );

		int iAniID = pGrp->GetAnimationIdx( m_AttackReadyAniList[iCurCombo] );
		float fTimeRate = (float)m_dwChargeTime / pGrp->GetAnimationFullTime( iAniID );
		pGrp->SetActionAni( iAniID, FLOAT100, FLOAT100, FLOAT1, FLOAT1/fTimeRate, 0.0f, 0.0f, true );

		m_ChargeState = CS_CHARGING;
		m_dwMotionStartTime = FRAMEGETTIME();
		m_iCurCombo = iCurCombo;
		pOwner->SetState( CS_ATTACK );
		pOwner->SetAttackMoveEnable( false );
		pOwner->SetChargingState( true );

		if( m_bChargeAutoTarget )
		{
			DWORD dwTrackingTime = FRAMEGETTIME();
			dwTrackingTime += pGrp->GetAnimationEventTime_e( iAniID, "tracking_e" ) * fTimeRate;
			pOwner->SetAutoTargetTrackingEndTime( dwTrackingTime );
		}
		else
			pOwner->StopAutoTargetTracking();
	}
}

void ioCannonWeaponItem::CheckNormalAttack( ioBaseChar *pOwner )
{
	switch( m_ChargeState )
	{
	case CS_CHARGING:
		ProcessCharging( pOwner );
		break;
	case CS_NORMAL_ATTACK:
		ProcessNormalAttack( pOwner );
		break;
	}
}

void ioCannonWeaponItem::ChangeToNormalAttack( ioBaseChar *pOwner )
{
	if ( !pOwner )
		return;

	pOwner->InitExtendAttackTagInfo();
	pOwner->InitActionStopDelay( true );
	ClearCancelInfo();

	pOwner->SetAttackMoveEnable( false );
	pOwner->SetChargingState( false );

	m_fCurChargeRate = 0.0f;
	m_fCurChargeRateForSkill = 0.0f;

	const AttackAttribute *pAttribute = m_FormalAttack.GetAttribute( AT_NORMAL, m_iCurCombo );
	if( pAttribute )
	{
		if( !m_bChargeAutoTarget )
			pOwner->SetAutoTarget( ATT_NORMAL );

		pOwner->SetNormalAttackByAttribute( *pAttribute );

		SetCurAttackAniForInputJump( pAttribute->m_AttackAnimation, pAttribute->m_fAttackAniRate );
	}

	pOwner->ApplyNormalAttackResult( m_iCurCombo );

	m_ChargeState = CS_NORMAL_ATTACK;

	if( pOwner->IsNeedSendNetwork() )
	{
		SP2Packet kPacket( CUPK_ITEM_GAUGE_OK );
		FillItemGaugePacketHeader( pOwner, kPacket );
		kPacket << ST_NORMAL_ATTACK;
		kPacket << pOwner->GetWorldPosition();
		kPacket << m_iCurCombo;
		if( !m_bChargeAutoTarget )
			pOwner->FillAutoTargetInfo( kPacket );
		P2PNetwork::SendToAllPlayingUser( kPacket );
	}
}

void ioCannonWeaponItem::ProcessCharging( ioBaseChar *pOwner )
{
	if( !pOwner || !pOwner->IsNeedProcess() )
		return;

	if( pOwner->IsAttackKeyDown() && !pOwner->IsHasCrown() && EnableCannonSpecialState( pOwner ) )
	{
		if( m_dwMotionStartTime + m_dwChargeTime <= FRAMEGETTIME() )
			SetCannonSpecialState( pOwner, true );
	}
	else
		ChangeToNormalAttack( pOwner );
}

void ioCannonWeaponItem::ProcessNormalAttack( ioBaseChar *pOwner )
{
	if ( !pOwner )
		return;

	if( pOwner->IsNeedProcess() )
	{
		CheckCancelReserve( pOwner );		
		if( ProcessCancel(pOwner) )
			return;
	}

	ioWeaponItem::CheckNormalAttack( pOwner );
}

bool ioCannonWeaponItem::EnableCannonSpecialState( ioBaseChar *pOwner )
{
	if ( !pOwner )
		return false;

	if ( pOwner->HasBuff( pOwner->GetCharName(), m_szDisableChargeBuff ) )
		return false;

	return true;
}

void ioCannonWeaponItem::SetCannonSpecialState( ioBaseChar *pOwner, bool bSendPacket )
{
	if ( !pOwner )
		return;

	pOwner->InitExtendAttackTagInfo();
	pOwner->ClearDirDoubleClick();
	pOwner->ClearReservedSliding();
	pOwner->SetForcePowerAmt( 0.0f );
	pOwner->SetCurMoveSpeed( 0.0f );
	pOwner->SetCurJumpPowerAmt( 0.0f );
	pOwner->SetGravityAmt( 0.0f );
	pOwner->ClearAttackFireTimeAndSkill();
	ClearCancelInfo();

	AddOwnerBuff( pOwner );

	m_dwControlDummyIndex = -1;
	m_dwStayDummyIndex = -1;

	if ( pOwner->GetState() != CS_CANNON_SPECIAL )
		pOwner->SetState( CS_CANNON_SPECIAL );

	pOwner->SetAlphaRateDirect( 0.0f );
	pOwner->SetAttachEffectAlphaRateDirect( 0, true );
	pOwner->SetHideChar( true );

	m_SpecailState = SS_START;
	if( bSendPacket )
		m_vStartPos = pOwner->GetWorldPosition();

	if( pOwner->IsNeedSendNetwork() )
	{
		SP2Packet kPacket( CUPK_ITEM_GAUGE_OK );
		FillItemGaugePacketHeader( pOwner, kPacket );
		kPacket << ST_CANNON_START;
		kPacket << m_vStartPos;
		P2PNetwork::SendToAllPlayingUser( kPacket );
	}
}

void ioCannonWeaponItem::ProcessCannonSpecialState( ioBaseChar *pOwner )
{
	if( !CheckSpecialState( pOwner ) )
	{
		pOwner->SetState( CS_DELAY );
		return;
	}

	switch( m_SpecailState )
	{
	case SS_START:
		if ( pOwner->IsNeedProcess() )
			ChangeToCannonDelayState( pOwner, true );
		break;
	case SS_CANNON_DELAY:
		ProcessCannonDelayState( pOwner );
		break;
	case SS_CANNON_CHARGE:
		ProcessCannonChargeState( pOwner );
		break;
	case SS_CANNON_ATTACK:
		ProcessCannonAttackState( pOwner );
		break;
	case SS_END_MOTION:
		ProcessCannonEndMotionState( pOwner );
		break;
	case SS_CANNON_ATTACK_FAIL:
		ProcessCannonAttackFailState( pOwner );
		break;
	}

	ProcessControlCannonRot( pOwner );
}

