noverapj/Legacy/src/NoveraClient/ioCannonWeaponItem.cpp
bool ioCannonWeaponItem::CheckSpecialState( ioBaseChar *pOwner )
{
	if ( !pOwner)
		return false;

	if ( m_SpecailState == SS_NONE )
		return false;

	if ( m_SpecailState != SS_START && m_SpecailState != SS_END_MOTION )
	{
		ioDummyChar *pStayDummy = g_DummyCharMgr.FindDummyChar( pOwner, m_dwStayDummyIndex );
		if ( !pStayDummy )
			return false;

		ioDummyChar *pControlDummy = g_DummyCharMgr.FindDummyChar( pOwner, m_dwControlDummyIndex );
		if ( !pControlDummy )
			return false;
	}

	return true;
}

void ioCannonWeaponItem::ProcessControlCannonRot( ioBaseChar *pOwner )
{
	if ( !pOwner )
		return;

	ioPlayStage *pStage	= pOwner->GetCreator();
	if ( !pStage )
		return;

	if ( m_SpecailState != SS_CANNON_DELAY && m_SpecailState != SS_CANNON_CHARGE )
		return;

	ioDummyChar *pStayDummy = g_DummyCharMgr.FindDummyChar( pOwner, m_dwStayDummyIndex );
	if ( !pStayDummy )
		return;

	ioDummyChar *pControlDummy = g_DummyCharMgr.FindDummyChar( pOwner, m_dwControlDummyIndex );
	if ( !pControlDummy )
		return;
	
	D3DXVECTOR3 vPos = pStayDummy->GetWorldPosition();
	vPos.y = pStage->GetMapHeight( vPos.x, vPos.z, pStayDummy, true );
	pStayDummy->SetWorldPosition( vPos );
	vPos.y = pStage->GetMapHeight( vPos.x, vPos.z, pControlDummy, true );
	pControlDummy->SetWorldPosition( vPos );

	bool bChange = false;
	if ( pOwner->IsNeedProcess() )
	{
		ioUserKeyInput::DirKeyInput eDir = pOwner->CheckCurDirKey();
		if ( eDir != m_CurDirKey )
		{
			m_CurDirKey = eDir;
			bChange = true;
		}
	}
	
	if( m_CurDirKey != ioUserKeyInput::DKI_NONE )
	{
		float fYawD = 180.0f + 45.0f * ( m_CurDirKey - ioUserKeyInput::DKI_UP );
		fYawD = ioMath::ArrangeHead( fYawD );
		D3DXQUATERNION qtRotate;
		D3DXVECTOR3 vPos;
		D3DXQuaternionRotationYawPitchRoll( &qtRotate, DEGtoRAD( fYawD ), 0.0f, 0.0f );

		vPos = qtRotate * D3DXVECTOR3( 0.0f, 0.0f, -FLOAT1 );
		vPos *= m_fCircleMoveSpeed * g_FrameTimer.GetSecPerFrame();
		m_vCirclePos += vPos;
	}

	D3DXVECTOR3 vCharPos = pOwner->GetWorldPosition();
	D3DXVECTOR3 vCurXZ = m_vCirclePos;

	vCharPos.y = 0.0f;
	vCurXZ.y = 0.0f;

	D3DXVECTOR3 vDiff = vCurXZ - vCharPos;
	if( D3DXVec3Length( &vDiff ) > m_fCircleMaxRange )
	{
		D3DXVec3Normalize( &vDiff, &vDiff );
		vDiff *= m_fCircleMaxRange;

		float fCurHeight = m_vCirclePos.y;
		m_vCirclePos = vCharPos + vDiff;
		m_vCirclePos.y = fCurHeight;
	}
	else if( D3DXVec3Length( &vDiff ) < m_fCircleMinRange )
	{
		D3DXVec3Normalize( &vDiff, &vDiff );
		vDiff *= m_fCircleMinRange;

		float fCurHeight = m_vCirclePos.y;
		m_vCirclePos = vCharPos + vDiff;
		m_vCirclePos.y = fCurHeight;
	}

	float fMapHeight = pStage->GetMapHeight( m_vCirclePos.x, m_vCirclePos.z, pOwner, false );
	if( fMapHeight > 0.0f )
		m_vCirclePos.y = fMapHeight;

	ioMapEffect *pEff = pStage->FindMapEffect( m_dwCircleEffectID );
	if( pEff )
	{
		pEff->SetWorldPosition( m_vCirclePos );
		pEff->SetWorldOrientation( pOwner->GetTargetRot() );
	}

	D3DXVECTOR3 vCircleDir = m_vCirclePos - pOwner->GetWorldPosition();
	vCircleDir.y = 0.0f;
	D3DXVec3Normalize( &vCircleDir, &vCircleDir );

	pOwner->SetTargetRotToDir( vCircleDir, true );
	pControlDummy->SetWorldOrientation( pOwner->GetTargetRot() );

	if ( bChange && pOwner->IsNeedSendNetwork() )
	{
		SP2Packet kPacket( CUPK_ITEM_GAUGE_OK );
		FillItemGaugePacketHeader( pOwner, kPacket );
		kPacket << ST_CANNON_DIR_CANGE;
		kPacket << (int)m_CurDirKey;
		kPacket << m_vCirclePos;
		P2PNetwork::SendToAllPlayingUser( kPacket );
	}
}

void ioCannonWeaponItem::ChangeToCannonDelayState( ioBaseChar *pOwner, bool bStart )
{
	m_SpecailState = SS_CANNON_DELAY;

	if ( !pOwner )
		return;

	ioPlayStage *pStage	= pOwner->GetCreator();
	if ( !pStage )
		return;

	D3DXVECTOR3 vPos;
	if( bStart )
		vPos = m_vStartPos;
	else
		vPos = pOwner->GetWorldPosition();

	if( !m_bCreateDummy )
	{
		D3DXQUATERNION qtRot = pOwner->GetWorldOrientation();
		int iIndex = g_DummyCharMgr.GetCurLocalIndex();
		D3DXVECTOR3 vDummyPos = vPos + qtRot * m_vStayDummyOffset;
		ioDummyChar *pStayDummy = pStage->CreateDummyChar( m_szStayDummyName, iIndex, pOwner->GetCharName(), vDummyPos, 0.0f, 0, true );
		if ( !pStayDummy )
			return;

		m_dwStayDummyIndex = pStayDummy->GetDummyCharIdx();

		vDummyPos = vPos + qtRot * m_vControlDummyOffset;
		iIndex = g_DummyCharMgr.GetCurLocalIndex();
		ioDummyChar *pControlDummy = pStage->CreateDummyChar( m_szControlDummyName, iIndex, pOwner->GetCharName(), vDummyPos, 0.0f, 0, true );
		if ( !pControlDummy )
			return;

		m_dwControlDummyIndex = pControlDummy->GetDummyCharIdx();
		m_bCreateDummy = true;

		ioCannonWeaponDummy* pCannon = ToCannonWeaponDummy( pControlDummy );
		if ( !pCannon )
			return;

		pCannon->SetTranslateEnable( false );
	}
	else
	{
		ioDummyChar *pControlDummy = g_DummyCharMgr.FindDummyChar( pOwner, m_dwControlDummyIndex );
		if ( !pControlDummy )
			return;
		ioCannonWeaponDummy* pCannon = ToCannonWeaponDummy( pControlDummy );
		if ( !pCannon )
			return;
		pCannon->SetCannonDelayState();
		pCannon->SetTranslateEnable( false );
	}

	if ( pOwner->IsNeedProcess() )
	{
		if ( m_vCirclePos == ioMath::VEC3_ZERO )
		{
			D3DXVECTOR3 vOffSet = pOwner->GetMoveDir() * m_fMagicCircleOffSet;
			m_vCirclePos = vPos + vOffSet;
			m_vCirclePos.y = pStage->GetMapHeight( m_vCirclePos.x, m_vCirclePos.z );
			if( m_vCirclePos.y <= 0.0f )
				m_vCirclePos.y = pOwner->GetBottomHeight();
		}
		
		D3DXVECTOR3 vScale( FLOAT1, FLOAT1, FLOAT1 );
		ioMapEffect* pMapEffect = pStage->CreateMapEffect( m_ReadyCircle, m_vCirclePos, vScale );
		if ( pMapEffect )
			m_dwCircleEffectID = pMapEffect->GetUniqueID();
	}

	if( pOwner->IsNeedSendNetwork() )
	{
		SP2Packet kPacket( CUPK_ITEM_GAUGE_OK );
		FillItemGaugePacketHeader( pOwner, kPacket );
		kPacket << ST_CANNON_DELAY;
		kPacket << m_vCirclePos;
		P2PNetwork::SendToAllPlayingUser( kPacket );
	}
}

void ioCannonWeaponItem::ProcessCannonDelayState( ioBaseChar *pOwner )
{
	if ( !pOwner )
		return;

	//공격 체크
	if ( pOwner->IsNeedProcess() )
	{
		if ( pOwner->IsAttackKey() )
		{
			ChangeToCannonCharge( pOwner );
			return;
		}

