noverapj/Legacy/src/NoveraClient/ioCannonWeaponItem.cpp
		// 종료 체크1
		if( pOwner->IsDefenseKey() )
		{
			ChangeToEndMotionState( pOwner );
			return;
		}

		// 종료 체크2
		if ( pOwner->IsJumpKey() )
		{
			ChangeToCannonEscape( pOwner );
			return;
		}
	}	
}

void ioCannonWeaponItem::ChangeToCannonCharge( ioBaseChar *pOwner )
{
	if ( !pOwner )
		return;

	ioDummyChar *pControlDummy = g_DummyCharMgr.FindDummyChar( pOwner, m_dwControlDummyIndex );
	if ( !pControlDummy )
		return;

	ioCannonWeaponDummy* pCannon = ToCannonWeaponDummy( pControlDummy );
	if ( !pCannon )
		return;

	pCannon->SetCannonChargeState();

	m_SpecailState = SS_CANNON_CHARGE;

	if( pOwner->IsNeedSendNetwork() )
	{
		SP2Packet kPacket( CUPK_ITEM_GAUGE_OK );
		FillItemGaugePacketHeader( pOwner, kPacket );
		kPacket << ST_CANNON_CHARGE;
		P2PNetwork::SendToAllPlayingUser( kPacket );
	}
}

void ioCannonWeaponItem::ProcessCannonChargeState( ioBaseChar *pOwner )
{
	if ( !pOwner || !pOwner->IsNeedProcess() )
		return;

	if( !pOwner->IsAttackKeyDown() )
	{
		if ( m_fCurExtraGauge < m_fCannonAttackNeedGauge )
		{
			ChangeToCannonAttackFailState( pOwner );
			return;
		}
		else
		{
			ChangeToCannonAttack( pOwner );
			return;
		}
	}
	
	if ( m_fCurExtraGauge == m_fMaxExtraGauge && !m_bCreateFullChargeEffect )
		AddCannonFullChargeEffect( pOwner );
}

void ioCannonWeaponItem::ChangeToCannonAttack( ioBaseChar *pOwner )
{
	if ( !pOwner )
		return;

	ioEntityGroup *pGrp = pOwner->GetGroup();
	if( !pGrp )
		return;

	ioDummyChar *pControlDummy = g_DummyCharMgr.FindDummyChar( pOwner, m_dwControlDummyIndex );
	if ( !pControlDummy )
		return;

	ioCannonWeaponDummy* pCannon = ToCannonWeaponDummy( pControlDummy );
	if ( !pCannon )
		return;

	if ( pOwner->IsNeedProcess() )
	{
		if ( m_fCurExtraGauge == m_fMaxExtraGauge )
			m_bFullGauge = true;
		else
			m_bFullGauge = false;
	}
	
	m_dwMotionEndTime = 0;
	m_dwFireStartTime = 0;
	DWORD dwCurTime = FRAMEGETTIME();
	pCannon->SetCannonAttackState( m_bFullGauge, m_dwMotionEndTime, m_dwFireStartTime );
	//if ( m_dwFireStartTime > 0 )
		m_dwFireStartTime += dwCurTime;
	m_dwMotionEndTime += dwCurTime;

	m_SpecailState = SS_CANNON_ATTACK;
	m_bCreateFullChargeEffect = false;
	ioMapEffect *pMapEffect = NULL;
	if( pOwner->GetTeam() == TEAM_RED )
		pMapEffect = pOwner->CreateMapEffectBySkill( m_RedEffect, m_vCirclePos );
	else if( pOwner->GetTeam() == TEAM_BLUE )
		pMapEffect = pOwner->CreateMapEffectBySkill( m_BlueEffect, m_vCirclePos );
	else
	{
		if( pOwner->GetSingleConvertTeam() == TEAM_BLUE )
			pMapEffect = pOwner->CreateMapEffectBySkill( m_BlueEffect, m_vCirclePos );
		else
			pMapEffect = pOwner->CreateMapEffectBySkill( m_RedEffect, m_vCirclePos );
	}

	CheckWeaponFloatInfo( pOwner );

	if( pMapEffect )
	{
		if( m_dwCurMapEffect != -1 )
			pOwner->EndMapEffect( m_dwCurMapEffect, false );

		m_dwCurMapEffect = pMapEffect->GetUniqueID();
	}

	// 카메라 흔들림 현상을 위한 더미 애니 추가
	int iAniID = pGrp->GetAnimationIdx( m_szCannonAttackAni );
	if ( iAniID != -1 )
	{
		float fTimeRate = m_fCannonAttackAniRate;
		if( fTimeRate <= 0.0f )
			fTimeRate = FLOAT1;

		pGrp->ClearAllLoopAni( FLOAT10, true );
		pGrp->ClearAllActionAni( FLOAT10, true );
		pGrp->SetActionAni( iAniID, FLOAT100, FLOAT100, FLOAT1, FLOAT1/fTimeRate );
	}

	//SendNet
	if( pOwner->IsNeedSendNetwork() )
	{
		SP2Packet kPacket( CUPK_ITEM_GAUGE_OK );
		FillItemGaugePacketHeader( pOwner, kPacket );
		kPacket << ST_CANNON_ATTACK;
		kPacket << m_bFullGauge;
		kPacket << m_vCirclePos;
		kPacket << pOwner->GetTargetRot();
		P2PNetwork::SendToAllPlayingUser( kPacket );
	}
	//

	DecreaseAllGauge();
	RemoveCircleMapEffect( pOwner );

}

void ioCannonWeaponItem::ProcessCannonAttackState( ioBaseChar *pOwner )
{
	if ( !pOwner || !pOwner->IsNeedProcess() )
		return;

	if ( m_dwMotionEndTime < FRAMEGETTIME() )
	{
		ChangeToCannonDelayState( pOwner, false );
		return;
	}

	if ( m_dwFireStartTime && m_dwFireStartTime < FRAMEGETTIME() )
	{
		m_dwFireStartTime = 0;
		CreateCannonWeapon( pOwner );
	}
}

void ioCannonWeaponItem::CreateCannonWeapon( ioBaseChar *pOwner )
{
	if ( !pOwner )
		return;

	WeaponInfo rkInfo;
	if ( m_bFullGauge )
		rkInfo = m_CannonFullAttack;
	else
		rkInfo = m_CannonAttack;

	//무기 생성
	FireTime kFireTime;
	kFireTime.dwStart = FRAMEGETTIME();

	kFireTime.iAttributeIdx = rkInfo.m_iWeaponIdx;
	kFireTime.iResistanceIdx = rkInfo.m_iResistanceIdx;
	kFireTime.szWoundedAni  = rkInfo.m_WoundedAnimation;
	kFireTime.dwWoundedAniDuration = rkInfo.m_dwWoundedDuration;
	kFireTime.bLoopWoundedAni = rkInfo.m_bWoundedLoopAni;
	kFireTime.dwWeaponIdx = pOwner->IncreaseWeaponIndexBase();
	kFireTime.eFireTimeType = FTT_NORMAL_ATTACK;
	D3DXVECTOR3 vPos = pOwner->GetMidPositionByRate();
	D3DXVECTOR3 vDir = pOwner->GetTargetRot() * D3DXVECTOR3( 0, 0, -1 );
	pOwner->ExtendFireExplicit( kFireTime, vPos, vDir, "" );

	if( pOwner->IsNeedSendNetwork() )
	{
		SP2Packet kPacket( CUPK_ITEM_GAUGE_OK );
		FillItemGaugePacketHeader( pOwner, kPacket );
		kPacket << ST_CANNON_FIRE;
		P2PNetwork::SendToAllPlayingUser( kPacket );
	}
}

void ioCannonWeaponItem::CheckWeaponFloatInfo( ioBaseChar *pOwner )
{
	// WeaponMove
	D3DXVECTOR3 vCharPos = pOwner->GetWorldPosition();
	D3DXVECTOR3 vDir = m_vCirclePos - vCharPos;
	vDir.y = 0.0f;

	float fRate = FLOAT1;
	float fRange = D3DXVec3Length( &vDir );
	D3DXVec3Normalize( &vDir, &vDir );

	// CharDir
	if( vDir == ioMath::VEC3_ZERO )
	{
		vDir = pOwner->GetTargetRot() * D3DXVECTOR3( 0.0f, 0.0f, -FLOAT1 );
		D3DXVec3Normalize( &vDir, &vDir );
	}
	else
	{
		D3DXQUATERNION qtRot;
		ioMath::CalcDirectionQuaternion( qtRot, -vDir );
		pOwner->SetTargetRotAndMoveDirChange( qtRot, false );
		pOwner->SetWorldOrientation( qtRot );
	}

	float fCurWeaponFloatPower = 0.0f;
	float fCurWeaponMoveSpeed = 0.0f;
	if( m_fCircleMaxRange > 0.0f )
	{
		fRate = fRange / m_fCircleMaxRange;

		// CurFloat
		fCurWeaponFloatPower = m_fWeaponFloatPower * fRate;
		fCurWeaponFloatPower = max( fCurWeaponFloatPower, m_fWeaponFloatMinPower );

		float fCurGravity = 0.0f;
		float fWeaponMoveSpeed = 0.0f;
		ioPlayStage *pStage = g_ItemMaker.GetPlayStage();
		if( pStage )
			fCurGravity = pStage->GetRoomGravity() * m_fWeaponGravityRate;

