noverapj/Legacy/src/NoveraClient/ioCannonWeaponItem.cpp
		float fFlightDuration = 0.0f;
		float fGapHeight = pOwner->GetMidHeightByRate(m_fRevisionRate) - vCharPos.y;
		float fGapHeight2 = vCharPos.y - m_vCirclePos.y;
		if( fGapHeight2 > 0.0f )
		{
			fGapHeight += fGapHeight2;
			fFlightDuration = GetFlightDuration( fCurGravity, fCurWeaponFloatPower, fGapHeight );

			if( fFlightDuration > 0.0f )
				fWeaponMoveSpeed = fRange / (fFlightDuration / FLOAT1000);

			fCurWeaponMoveSpeed = max( m_fWeaponMinSpeed, fWeaponMoveSpeed );
		}
		else if( COMPARE(fGapHeight2, -m_fUpLimitHeight, -20.0f) && fRange > m_fUpLimitRange )
		{
			float fNewGap = fabs( fGapHeight2 ) - fGapHeight;
			fFlightDuration = GetTargetTime( fCurGravity, fNewGap, fCurWeaponFloatPower );
			fRange -= 35.0f;

			if( fFlightDuration > 0.0f )
				fCurWeaponMoveSpeed = fRange / (fFlightDuration / FLOAT1000);
		}
		else
		{
			fFlightDuration = GetFlightDuration( fCurGravity, fCurWeaponFloatPower, fGapHeight );

			if( fFlightDuration > 0.0f )
				fWeaponMoveSpeed = fRange / (fFlightDuration / FLOAT1000);

			fCurWeaponMoveSpeed = max( m_fWeaponMinSpeed, fWeaponMoveSpeed );
		}
	}

	m_vWeaponDir = vDir;
	m_fCurWeaponMoveSpeed = fCurWeaponMoveSpeed;
	m_fCurWeaponFloatPower = fCurWeaponFloatPower;
}

float ioCannonWeaponItem::GetFlightDuration( float fCurGravity, float fCurWeaponFloatPower, float fGapHeight )
{
	float fTopTime, fTopHeight, fGapTime;
	fTopTime = fTopHeight = fGapTime = 0.0f;

	float fNewGravity = fCurGravity;
	if( fNewGravity > 0.0f )
	{
		fTopTime = fCurWeaponFloatPower / fNewGravity;
		//fTopHeight = (fCurWeaponFloatPower*fTopTime) - (0.5f*fNewGravity*fTopTime*fTopTime);
	}

	float fCurFloatPower = -fCurWeaponFloatPower;
	float fCurGapHeight = 0.0f;
	while( fCurGapHeight < fGapHeight )
	{
		fCurGapHeight += fabs(fCurFloatPower * 0.01f);
		fCurFloatPower -= fNewGravity * 0.01;
		fGapTime += 0.01;
	}

	float fResult = 2 * fTopTime * FLOAT1000;
	fResult += fGapTime * FLOAT1000;
	return fResult;
}

float ioCannonWeaponItem::GetTargetTime( IN float fCurGravity, IN float fGapHeight, OUT float &fFloatPower )
{
	float fGapTime = 0.0f;
	float fCurFloatPower = 0;
	float fCurGapHeight = 0.0f;

	float fRevisionH = FLOAT100;
	float fTopHeight = fGapHeight + fRevisionH;

	// Top Check
	float fTopTime = 0.0f;
	do
	{
		fTopTime = fGapTime;

		fCurGapHeight += fabs(fCurFloatPower * 0.01f);
		fCurFloatPower += fCurGravity * 0.01;
		fGapTime += 0.01;
	} while( fCurGapHeight < fTopHeight );

	fFloatPower = fCurFloatPower;


	// Target Check
	fGapTime = 0.0f;
	fCurFloatPower = 0;
	fCurGapHeight = 0.0f;

	float fTargetTime = 0.18f;

	fTargetTime += fTopTime;
	fTargetTime *= FLOAT1000;
	return fTargetTime;
}

void ioCannonWeaponItem::ChangeToEndMotionState( ioBaseChar *pOwner )
{
	if ( !pOwner )
		return;

	pOwner->ClearReservedSliding();
	ClearCancelInfo();

	ioEntityGroup *pGrp = pOwner->GetGroup();
	if( !pGrp )
		return;

	int iAniID = pGrp->GetAnimationIdx( m_szCannonEndAni );
	if ( iAniID == -1 )
		return;

	float fTimeRate = m_fCannonEndAniRate;
	if( fTimeRate <= 0.0f )
		fTimeRate = FLOAT1;

	pGrp->ClearAllLoopAni( FLOAT10, true );
	pGrp->ClearAllActionAni( FLOAT10, true );
	pGrp->SetActionAni( iAniID, FLOAT100, FLOAT100, FLOAT1, FLOAT1/fTimeRate );

	pOwner->SetAlphaRateDirect( MAX_ALPHA_RATE );
	pOwner->SetAttachEffectAlphaRateDirect( MAX_ALPHA_RATE, true );
	pOwner->SetHideChar( false );

	ioDummyChar *pControlDummy = g_DummyCharMgr.FindDummyChar( pOwner, m_dwControlDummyIndex );
	if ( !pControlDummy )
		return;
	pControlDummy->SetDieState( false, true );

	m_SpecailState = SS_END_MOTION;

	DWORD dwCurTime = FRAMEGETTIME();
	m_dwMotionEndTime = dwCurTime + pGrp->GetAnimationFullTime(iAniID) * fTimeRate;
	m_dwKeyReserveTime = pGrp->GetAnimationEventTime_e( iAniID, "key_reserve" ) * fTimeRate;
	if( m_dwKeyReserveTime > 0 )
		m_dwKeyReserveTime += dwCurTime;

	RemoveCircleMapEffect( pOwner );
	RemoveOwnerBuff( pOwner );

	if( pOwner->IsNeedSendNetwork() )
	{
		SP2Packet kPacket( CUPK_ITEM_GAUGE_OK );
		FillItemGaugePacketHeader( pOwner, kPacket );
		kPacket << ST_CANNON_END;
		P2PNetwork::SendToAllPlayingUser( kPacket );
	}
}

void ioCannonWeaponItem::ProcessCannonEndMotionState( ioBaseChar *pOwner )
{
	if ( !pOwner )
		return;

	if ( pOwner->IsNeedProcess() )
	{
		DWORD dwCurTime = FRAMEGETTIME();
		if( m_dwMotionEndTime < dwCurTime )
		{
			pOwner->SetState( CS_DELAY );
			return;
		}
	}
	
}

void ioCannonWeaponItem::ChangeToCannonEscape( ioBaseChar *pOwner )
{
	if ( !pOwner )
		return;

	ioDummyChar *pControlDummy = g_DummyCharMgr.FindDummyChar( pOwner, m_dwControlDummyIndex );
	if ( !pControlDummy )
		return;

	ioCannonWeaponDummy* pCannon = ToCannonWeaponDummy( pControlDummy );
	if ( !pCannon )
		return;

	ioDummyChar *pStayDummy = g_DummyCharMgr.FindDummyChar( pOwner, m_dwStayDummyIndex );
	if ( !pStayDummy )
		return;

	ioCannonWeaponDummy* pStayCannon = ToCannonWeaponDummy( pStayDummy );
	if ( !pStayCannon )
		return;

	pOwner->SetAlphaRateDirect( MAX_ALPHA_RATE );
	pOwner->SetAttachEffectAlphaRateDirect( MAX_ALPHA_RATE, true );
	pOwner->SetHideChar( false );

	DWORD dwMotionEndTime = pCannon->SetCannonDeadLineState();
	pStayCannon->SetCannonDeadLineState( dwMotionEndTime );

	pOwner->SetExtendAttackEndJump( m_fCannonEscapeEndJumpPower, FLOAT1, false, true, true );

	pOwner->AddNewBuff( m_szDisableChargeBuff, pOwner->GetCharName(), GetName(), NULL );

	RemoveCircleMapEffect( pOwner );

	if( pOwner->IsNeedSendNetwork() )
	{
		SP2Packet kPacket( CUPK_ITEM_GAUGE_OK );
		FillItemGaugePacketHeader( pOwner, kPacket );
		kPacket << ST_CANNON_ESCAPE;
		P2PNetwork::SendToAllPlayingUser( kPacket );
	}
}

void ioCannonWeaponItem::ChangeToCannonAttackFailState( ioBaseChar *pOwner )
{
	if ( !pOwner )
		return;

	ioDummyChar *pControlDummy = g_DummyCharMgr.FindDummyChar( pOwner, m_dwControlDummyIndex );
	if ( !pControlDummy )
		return;
	ioCannonWeaponDummy* pCannon = ToCannonWeaponDummy( pControlDummy );
	if ( !pCannon )
		return;
	m_dwMotionEndTime = 0;
	pCannon->SetCannonAttackFailState( m_dwMotionEndTime );

	m_SpecailState = SS_CANNON_ATTACK_FAIL;

