noverapj/Legacy/src/NoveraClient/ioCannonWeaponItem.cpp
	RemoveCircleMapEffect( pOwner );
	m_bCreateFullChargeEffect = false;

	if( pOwner->IsNeedSendNetwork() )
	{
		SP2Packet kPacket( CUPK_ITEM_GAUGE_OK );
		FillItemGaugePacketHeader( pOwner, kPacket );
		kPacket << ST_CANNON_ATTACK_FAIL;
		P2PNetwork::SendToAllPlayingUser( kPacket );
	}

	m_fCurExtraGauge = 0.0f;
}

void ioCannonWeaponItem::ProcessCannonAttackFailState( ioBaseChar *pOwner )
{
	if ( !pOwner || !pOwner->IsNeedProcess() )
		return;

	if ( m_dwMotionEndTime < FRAMEGETTIME() )
	{
		ChangeToCannonDelayState( pOwner, false );
		return;
	}
}

void ioCannonWeaponItem::UpdateExtraData( ioBaseChar *pOwner )
{
	if( !pOwner )
		return;
	if( m_fCurExtraGauge >= m_fMaxExtraGauge )
		return;

	if ( pOwner->GetState() == CS_CANNON_SPECIAL && m_SpecailState == SS_CANNON_CHARGE )
	{
		float fTimePerSec = g_FrameTimer.GetSecPerFrame();
		float fGauge = m_fExtraGaugeBaseInc * fTimePerSec;

		m_fCurExtraGauge += fGauge;
		m_fCurExtraGauge = min( m_fCurExtraGauge, m_fMaxExtraGauge );
	}
}

void ioCannonWeaponItem::SetExtraInfoToWeapon( ioWeapon *pWeapon, bool bJumpAttack )
{
	ioAttackableItem::SetExtraInfoToWeapon( pWeapon, bJumpAttack );

	float fCurDamageRate, fCurForceRate, fCurBlowRate;
	float fCurWoundedTimeRate, fCurLiveTimeRate;

	fCurDamageRate = fCurForceRate = fCurBlowRate = FLOAT1;
	fCurWoundedTimeRate = fCurLiveTimeRate = FLOAT1;

	if( m_fCurChargeRate > 0.0f && !bJumpAttack )
	{
		float fCurMaxDamage = max( 0.0f, (m_fMaxDamageRate - FLOAT1) );
		float fCurMaxForce = max( 0.0f, (m_fMaxForceRate - FLOAT1) );
		float fCurMaxBlow = max( 0.0f, (m_fMaxBlowRate - FLOAT1) );

		float fCurMaxWoundedTime = max( 0.0f, (m_fMaxWoundedTimeRate - FLOAT1) );
		float fCurMaxLiveTime = max( 0.0f, (m_fMaxLiveTimeRate - FLOAT1) );

		fCurDamageRate += fCurMaxDamage * m_fCurChargeRate;
		fCurForceRate += fCurMaxForce * m_fCurChargeRate;
		fCurBlowRate += fCurMaxBlow * m_fCurChargeRate;

		fCurWoundedTimeRate += fCurMaxWoundedTime * m_fCurChargeRate;
		fCurLiveTimeRate += fCurMaxLiveTime * m_fCurChargeRate;

		pWeapon->SetOwnerChargeDamageRate( fCurDamageRate );
		pWeapon->SetOwnerChargeForceRate( fCurForceRate );
		pWeapon->SetOwnerChargeBlowRate( fCurBlowRate );

		pWeapon->SetOwnerChargeWoundedTimeRate( fCurWoundedTimeRate );
		pWeapon->SetOwnerChargeLiveTimeRate( fCurLiveTimeRate );
	}

	ioFloatThrowWeapon *pFloatWeapon = ToFloatThrowWeapon(pWeapon);
	if( !bJumpAttack && pFloatWeapon )
	{
		pFloatWeapon->SetMoveDir( m_vWeaponDir );
		pFloatWeapon->SetMoveSpeed( m_fCurWeaponMoveSpeed );
		pFloatWeapon->SetFloatPower( m_fCurWeaponFloatPower );
		pFloatWeapon->SetGravityRate( m_fWeaponGravityRate );
	}

	//
	ioZoneEffectWeapon *pZone = ToZoneEffectWeapon( pWeapon );
	if( pZone )
	{
		ioBaseChar *pChar = pZone->GetOwner();
		if( pChar )
		{
			D3DXVECTOR3 vDir = pChar->GetTargetRot() * D3DXVECTOR3( 0.0f, 0.0f, -FLOAT1 );
			pZone->SetCollisionDir( vDir );
			pZone->SetZoneValue( false, false );
		}
	}
}

void ioCannonWeaponItem::AddOwnerBuff( ioBaseChar *pOwner )
{
	if ( !pOwner )
		return;

	int nBuffCnt = (int)m_vOwnerBuffList.size();
	for ( int i=0; i<nBuffCnt; i++ )
		pOwner->AddNewBuff( m_vOwnerBuffList[i], pOwner->GetCharName(), GetName(), NULL );
}

void ioCannonWeaponItem::RemoveOwnerBuff( ioBaseChar *pOwner )
{

	if ( !pOwner )
		return;

	int nBuffCnt = (int)m_vOwnerBuffList.size();
	for ( int i=0; i<nBuffCnt; i++ )
	{
		ioBuff *pRemoveBuff = pOwner->GetBuff( m_vOwnerBuffList[i], pOwner->GetCharName() );
		if ( pRemoveBuff )
			pRemoveBuff->SetReserveEndBuff();
	}
}

void ioCannonWeaponItem::RemoveCircleMapEffect( ioBaseChar *pOwner )
{
	if ( !pOwner )
		return;
	ioPlayStage *pStage	= pOwner->GetCreator();
	if ( !pStage )
		return;

	if ( m_dwCircleEffectID == -1 )
		return;

	ioMapEffect *pEff = pStage->FindMapEffect( m_dwCircleEffectID );
	if( pEff )
		pEff->EndEffectForce();
	m_dwCircleEffectID = -1;
}

void ioCannonWeaponItem::AddCannonFullChargeEffect( ioBaseChar *pOwner )
{
	if ( !pOwner )
		return;

	if ( m_bCreateFullChargeEffect )
		return;

	ioDummyChar *pControlDummy = g_DummyCharMgr.FindDummyChar( pOwner, m_dwControlDummyIndex );
	if ( !pControlDummy )
		return;

	ioCannonWeaponDummy* pCannon = ToCannonWeaponDummy( pControlDummy );
	if ( !pCannon )
		return;

	pCannon->AddFullChargeEffect();

	m_bCreateFullChargeEffect = true;

	if( pOwner->IsNeedSendNetwork() )
	{
		SP2Packet kPacket( CUPK_ITEM_GAUGE_OK );
		FillItemGaugePacketHeader( pOwner, kPacket );
		kPacket << ST_CANNON_FULL_CHARGE_EFFECT;
		P2PNetwork::SendToAllPlayingUser( kPacket );
	}
}

void ioCannonWeaponItem::OnItemGaugeOK( ioBaseChar *pOwner, SP2Packet &rkPacket )
{
	if ( !pOwner )
		return;

	int iState;
	rkPacket >> iState;

	if ( iState == ST_NORMAL_ATTACK )
	{
		D3DXVECTOR3 vPos;
		rkPacket >> vPos;
		pOwner->SetWorldPosition( vPos );

		rkPacket >> m_iCurCombo;
		if( !m_bChargeAutoTarget )
			pOwner->ApplyAutoTargetInfo( rkPacket );
		ChangeToNormalAttack( pOwner );
	}
	else if ( iState == ST_CANNON_START )
	{
		rkPacket >> m_vStartPos;		
		SetCannonSpecialState( pOwner, false );
	}
	else if ( iState == ST_CANNON_DELAY )
	{
		rkPacket >> m_vCirclePos;
		ChangeToCannonDelayState( pOwner, true );
	}
	else if ( iState == ST_CANNON_CHARGE )
		ChangeToCannonCharge( pOwner );
	else if ( iState == ST_CANNON_END )
		ChangeToEndMotionState( pOwner );
	else if ( iState == ST_CANNON_ESCAPE )
		ChangeToCannonEscape( pOwner );
	else if ( iState == ST_CANNON_ATTACK )
	{
		D3DXQUATERNION qtRot;
		rkPacket >> m_bFullGauge;
		rkPacket >> m_vCirclePos;
		rkPacket >> qtRot;
		pOwner->SetTargetRotAndMoveDirChange( qtRot );
		ChangeToCannonAttack( pOwner );
	}
	else if ( iState == ST_CANNON_FIRE )
		CreateCannonWeapon( pOwner );
	else if ( iState == ST_CANNON_ATTACK_FAIL )
		ChangeToCannonAttackFailState( pOwner );
	else if ( iState == ST_CANNON_FULL_CHARGE_EFFECT )
		AddCannonFullChargeEffect( pOwner );
	else if ( iState == ST_CANNON_DIR_CANGE )
	{
		int iDir;
		rkPacket >> iDir;
		m_CurDirKey = (ioUserKeyInput::DirKeyInput)iDir;
		rkPacket >> m_vCirclePos;
	}
}

//---------------------------------------------------------------
ioCannonSpecialState::ioCannonSpecialState()
{

}

ioCannonSpecialState::~ioCannonSpecialState()
{

}

void ioCannonSpecialState::Finalize( ioBaseChar* pOwner, CharState eCurrState, CharState eNewState )
{
	ioSpecialStateBase::Finalize( pOwner, eCurrState, eNewState );

	ioCannonWeaponItem *pCannonWeaponItem = ToCannonWeaponItem( pOwner->GetPriorityItem( SPT_ATTACK ) );
	if( pCannonWeaponItem )
		pCannonWeaponItem->ClearSpecialState( pOwner );
}

void ioCannonSpecialState::CheckSpecialState( ioBaseChar* pOwner )
{
	ioCannonWeaponItem *pCannonWeaponItem = ToCannonWeaponItem( pOwner->GetPriorityItem( SPT_ATTACK ) );
	if( pCannonWeaponItem )
		pCannonWeaponItem->ProcessCannonSpecialState( pOwner );
	else
	{
		pOwner->SetState( CS_DELAY );
		pOwner->SetFallState( true );
		return;
	}
}

bool ioCannonSpecialState::IsCharCollisionSkipState( const ioBaseChar *const pOwner, DWORD dwStartTime, DWORD dwEndTime, DWORD dwSkipType, bool bTeamOnly, bool bDefense, TeamType eOwnerTeam, TeamType eOtherTeam ) const
{
	return true;
}

